In [8]:
import numpy as np
from pandas import DataFrame,Series
import pandas as pd
from numpy.random import randn as ra

In [9]:
s1=Series(ra(6), index=[[1,1,1,2,2,2],['a','b','c','a','b','c']])
s1

1  a   -1.096573
   b    1.888058
   c   -0.470222
2  a   -0.175227
   b   -1.300565
   c   -0.621563
dtype: float64

In [10]:
s1[1]

a   -1.096573
b    1.888058
c   -0.470222
dtype: float64

In [11]:
s1[1]['a']

-1.0965734500370816

In [12]:
s1.index

MultiIndex(levels=[[1, 2], ['a', 'b', 'c']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [13]:
s1[:,'a']

1   -1.096573
2   -0.175227
dtype: float64

In [14]:
s1[:,'b']

1    1.888058
2   -1.300565
dtype: float64

In [15]:
s1.unstack()

          a         b         c
1 -1.096573  1.888058 -0.470222
2 -0.175227 -1.300565 -0.621563

In [16]:
s1

1  a   -1.096573
   b    1.888058
   c   -0.470222
2  a   -0.175227
   b   -1.300565
   c   -0.621563
dtype: float64

In [17]:
df1=s1.unstack()
df1

          a         b         c
1 -1.096573  1.888058 -0.470222
2 -0.175227 -1.300565 -0.621563

In [18]:
df1.unstack()

a  1   -1.096573
   2   -0.175227
b  1    1.888058
   2   -1.300565
c  1   -0.470222
   2   -0.621563
dtype: float64

In [23]:
df2= DataFrame(np.arange(16).reshape(4,4),index=[[1,1,2,2],['a','b','a','b']],columns=[['East','East','West','West'],
                                                                                       ['Uyo','Abak','Ibadan','Lagos']])
df2

    East        West
     Uyo Abak Ibadan Lagos
1 a    0    1      2     3
  b    4    5      6     7
2 a    8    9     10    11
  b   12   13     14    15

In [28]:
df2.index.names=['Rain','Sun']
df2

         East        West
          Uyo Abak Ibadan Lagos
Rain Sun
1    a      0    1      2     3
     b      4    5      6     7
2    a      8    9     10    11
     b     12   13     14    15

In [29]:
df2.columns.names=['Direction','Town']
df2

Direction East        West
Town       Uyo Abak Ibadan Lagos
Rain Sun
1    a       0    1      2     3
     b       4    5      6     7
2    a       8    9     10    11
     b      12   13     14    15

In [50]:
df2.swaplevel('Rain','Sun')
df2

Direction East        West
Town       Uyo Abak Ibadan Lagos
Rain Sun
1    a       0    1      2     3
     b       4    5      6     7
2    a       8    9     10    11
     b      12   13     14    15

In [45]:
df2.sort_index(level=0,axis=1)
df2

Direction East        West
Town       Uyo Abak Ibadan Lagos
Rain Sun
1    a       0    1      2     3
     b       4    5      6     7
2    a       8    9     10    11
     b      12   13     14    15

In [43]:
df2.sum(level='Direction',axis=1)

Direction  East  West
Rain Sun
1    a        1     5
     b        9    13
2    a       17    21
     b       25    29

In [44]:
df2.index

MultiIndex(levels=[[1, 2], ['a', 'b']],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['Rain', 'Sun'])

In [ ]:
df2.sw